{"class_name": "Functional", "config": {"name": "v2_model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 707], "dtype": "float32", "sparse": false, "ragged": false, "name": "v2_input_0"}, "name": "v2_input_0", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "v2_en_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 39, "output_dim": 500, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "v2_en_embedding", "inbound_nodes": [[["v2_input_0", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "v2_LSTM1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 500, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "v2_LSTM1", "inbound_nodes": [[["v2_en_embedding", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "ragged": false, "name": "v2_input_1"}, "name": "v2_input_1", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "v2_LSTM2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 500, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 9}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 10}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "v2_LSTM2", "inbound_nodes": [[["v2_LSTM1", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "v2_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 399, "output_dim": 500, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "v2_embedding", "inbound_nodes": [[["v2_input_1", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "v2_LSTM3", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 500, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 16}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 17}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 18}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "v2_LSTM3", "inbound_nodes": [[["v2_LSTM2", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "v2_lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 500, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 21}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 22}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 23}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "v2_lstm", "inbound_nodes": [[["v2_embedding", 0, 0, {}], ["v2_LSTM3", 0, 1, {}], ["v2_LSTM3", 0, 2, {}]]]}, {"class_name": "Attention", "config": {"name": "v2_attention", "trainable": true, "dtype": "float32", "causal": false, "dropout": 0.0, "use_scale": false, "score_mode": "dot"}, "name": "v2_attention", "inbound_nodes": [[["v2_lstm", 0, 0, {}], ["v2_LSTM3", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "v2_concat_layer1", "trainable": true, "dtype": "float32", "axis": -1}, "name": "v2_concat_layer1", "inbound_nodes": [[["v2_lstm", 0, 0, {}], ["v2_attention", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "v2_dense", "trainable": true, "dtype": "float32", "units": 399, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "v2_dense", "inbound_nodes": [[["v2_concat_layer1", 0, 0, {}]]]}], "input_layers": [["v2_input_0", 0, 0], ["v2_input_1", 0, 0]], "output_layers": [["v2_dense", 0, 0]]}, "keras_version": "2.9.0", "backend": "tensorflow"}